
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавление варианта отчета в подсистему Отчеты
// 
// Параметры:
//   Настройки - ТаблицаЗначений - коллекция предопределенных вариантов отчетов, 
//   НастройкиОтчета  - СтрокаДереваЗначений
//                    - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Предоставляет информацию о том, какие суммы начислены и выплачены каждому сотруднику за указанный период.'");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
