
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	// {{Егоров И.В. Доработка от 15.09.2025
	Если ВКМ_ДобавитьДвиженияВРегистрВыставленныеЗаРаботыАкты() Тогда
		Отказ = Истина;
	КонецЕсли;
	// }}Егоров И.В. Доработка от 15.09.2025

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

// Автозаполнение табличной части Услуги документа с договором типа абонентское обслуживание
 
Функция ВКМ_ВыполнитьАвтозаполнение() Экспорт
	
	// {{Егоров И.В. Процедура автозаполнения документа абонентского обслуживания от 15.09.2025
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) КАК Часы,
		|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) КАК Сумма,
		|	ВКМ_НоменклатураАбонентскаяПлата.Значение КАК НоменклатураАбонентскаяПлата,
		|	ВКМ_НоменклатураРаботыСпециалиста.Значение КАК НоменклатураРаботыСпециалиста,
		|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
		|	ДоговорыКонтрагентов.ВидДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&Период, МЕСЯЦ),, Договор = &Договор
		|		И Клиент = &Клиент) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
		|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор,
		|	Константа.ВКМ_НоменклатураАбонентскаяПлата КАК ВКМ_НоменклатураАбонентскаяПлата,
		|	Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ОбщегоНазначения.СообщитьПользователю("Автозаполнение документа невозможно: Выбран неподходящий тип Договора.",,"Договор","Объект");
			Возврат Ложь;
		КонецЕсли;
		
		ТекстСообщения = "";
		
		Если Не ЗначениеЗаполнено(Выборка.НоменклатураАбонентскаяПлата) Тогда
			ТекстСообщения = СтрШаблон("%1%2%3", ТекстСообщения, "Не задано значение константы ""ВКМ_НоменклатураАбонентскаяПлата""", Символы.ПС);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.НоменклатураРаботыСпециалиста) Тогда
			ТекстСообщения = СтрШаблон("%1%2%3", ТекстСообщения, "Не задано значение константы ""ВКМ_НоменклатураРаботыСпециалиста""", Символы.ПС);
		КонецЕсли;
		
		Если СтрДлина(ТекстСообщения) > 0 Тогда
			ТекстСообщения = СтрШаблон("%1%2", ТекстСообщения, "Автозаполнение невозможно");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		
		Товары.Очистить();
		Услуги.Очистить();
		
		Если Выборка.СуммаАбонентскойПлаты > 0 Тогда
			СтрокаТЧУслуги = Услуги.Добавить();
			СтрокаТЧУслуги.Номенклатура = Выборка.НоменклатураАбонентскаяПлата;
			СтрокаТЧУслуги.Количество = 1;
			СтрокаТЧУслуги.Цена = Выборка.СуммаАбонентскойПлаты;
			СтрокаТЧУслуги.Сумма = СтрокаТЧУслуги.Количество * СтрокаТЧУслуги.Цена;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Часы) И ЗначениеЗаполнено(Выборка.Сумма) Тогда
			СтрокаТЧУслуги = Услуги.Добавить();
			СтрокаТЧУслуги.Номенклатура = Выборка.НоменклатураРаботыСпециалиста;
			СтрокаТЧУслуги.Количество = Выборка.Часы;
			СтрокаТЧУслуги.Сумма = Выборка.Сумма;
			СтрокаТЧУслуги.Цена = ?(СтрокаТЧУслуги.Количество > 0, СтрокаТЧУслуги.Сумма / СтрокаТЧУслуги.Количество, 0);
		КонецЕсли;
		
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	Возврат Истина;
	
	// }}Егоров И.В. Процедура автозаполнения документа абонентского обслуживания от 15.09.2025
КонецФункции

Функция ВКМ_ДобавитьДвиженияВРегистрВыставленныеЗаРаботыАкты()
	Отказ = Ложь;
	ВидДоговора = Неопределено;
	АбонентскаяПлата = Неопределено;
	РаботыСпециалиста = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НоменклатураАбонентскаяПлата.Значение КАК АбонентскаяПлата,
		|	ВКМ_НоменклатураРаботыСпециалиста.Значение КАК РаботыСпециалиста,
		|	РеализацияТоваровУслуг.Договор.ВидДоговора КАК ВидДоговора
		|ИЗ
		|	Константа.ВКМ_НоменклатураАбонентскаяПлата КАК ВКМ_НоменклатураАбонентскаяПлата,
		|	Константа.ВКМ_НоменклатураРаботыСпециалиста КАК ВКМ_НоменклатураРаботыСпециалиста,
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		АбонентскаяПлата = Выборка.АбонентскаяПлата;
		РаботыСпециалиста = Выборка.РаботыСпециалиста;
		ВидДоговора = Выборка.ВидДоговора;
	КонецЕсли;
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Движения.ВКМ_ВыставленныеЗаРаботыАкты.Записывать = Истина;

		СуммаРаботыСпециалиста = 0;
		СуммаАбонентскаяПлата = 0;
		
		Если Не ЗначениеЗаполнено(АбонентскаяПлата) Или Не ЗначениеЗаполнено(РаботыСпециалиста) Тогда
			ОбщегоНазначения.СообщитьПользователю("Проверьте заполнение костант ""ВКМ_НоменклатураАбонентскаяПлата"" и ""ВКМ_НоменклатураРаботыСпециалиста""");
			Отказ = Истина;
		КонецЕсли;
		
		Для Каждого ТекСтрокаУслуги Из Услуги Цикл
			Если ТекСтрокаУслуги.Номенклатура = РаботыСпециалиста Тогда
				СуммаРаботыСпециалиста = СуммаРаботыСпециалиста + ТекСтрокаУслуги.Сумма;
			ИначеЕсли ТекСтрокаУслуги.Номенклатура = АбонентскаяПлата Тогда
				 СуммаАбонентскаяПлата = СуммаАбонентскаяПлата + ТекСтрокаУслуги.Сумма;
			КонецЕсли;
		КонецЦикла;
		
		Движение = Движения.ВКМ_ВыставленныеЗаРаботыАкты.Добавить();
		Движение.Договор = Договор;
		Движение.Клиент = Контрагент;
		Движение.Период = Дата;
		Движение.СуммаАбонентскаяПлата = СуммаАбонентскаяПлата;
		Движение.СуммаРаботыСпециалиста = СуммаРаботыСпециалиста;
	КонецЕсли;
	Возврат Отказ;
КонецФункции


#КонецОбласти

#КонецЕсли
