
#Область ОбработчикиСобытийФормы



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = "";
	Если Параметры.Свойство("Адрес", Адрес) Тогда
		СтруктураДанных = ПолучитьИзВременногоХранилища(Адрес);
		Год = СтруктураДанных.Год;
		ТЧ.Загрузить(СтруктураДанных.ДанныеТаблицы);
	КонецЕсли;
	
	МаксимальноеЧислоДнейОтпуска = Константы.ВКМ_МаксимальноеЧислоДнейОтпуска.Получить();
	
	ЗаполнитьДиаграммуНаСервере();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьДиаграммуНаСервере()
	
	ГрафикОтпусков.Очистить();
	ГрафикОтпусков.Обновление = Ложь;
	ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
	ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГода(Год),КонецГода(Год));
	
	ЭлементМеток = ГрафикОтпусков.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.Месяц;;
	ЭлементМеток.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	
	ЭлементМеток.Формат = "ДФ=MMММ;";
	
	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	Серия.ШтриховкаПерекрывающихсяИнтервалов = Истина;
	Серия.ПриоритетЦвета = Истина;
		
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		Значение.Данные.ДнейОтпуска = Значение.Данные.ДнейОтпуска + СтрокаТЧ.ДнейОтпуска;
		
		Если Значение.Данные.ДнейОтпуска > МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.СветлоРозовый;
		ИначеЕсли Значение.Данные.ДнейОтпуска < МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.ЦианСветлый;
		ИначеЕсли Значение.Данные.ДнейОтпуска = МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.Белый;
		КонецЕсли;
		
		Интервал = Значение.Добавить(); 
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец = СТрокаТЧ.ДатаОкончания;
		
	КонецЦикла;
	
	ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры
#КонецОбласти