
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПредзаполнитьТаблицу(Команда)
	Если Объект.СписокСотрудников.Количество() > 0 Тогда
		ПредзаполнитьТаблицуАсинх();
	Иначе
		ПредзаполнитьТаблицуНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ПредзаполнитьТаблицуАсинх()
	ТекстВопроса = Стршаблон("Табличная часть документа будет очищена. Продолжить?");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет, "Внимание!");
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ПредзаполнитьТаблицуНаСервере();

КонецПроцедуры


&НаСервере
Процедура ПредзаполнитьТаблицуНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПредзаполнитьДокумент();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры
#КонецОбласти

