#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.Выплаты.Количество() > 0 Тогда
		ЗаполнитьТаблицуАсинх();
	Иначе
		ЗаполнитьТаблицуНаСервере();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПредзаполнитьДокумент();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьТаблицуАсинх()
	ТекстВопроса = Стршаблон("Табличная часть документа будет очищена. Продолжить?");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет, "Внимание!");
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры
#КонецОбласти

